Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །དེ་ནས་བརྒྱ་བྱིན་ལྷའི་དབང་པོ་འདི་སྙམ་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་འདི་ཆོས་འདོད་པའི་ཕྱིར། ཡང་དག་པའི་བསམ་པས་བདག་གི་ལུས་ཡོངས་སུ་གཏོང་ངམ། འོན་ཏེ་མ་ཡིན་པ་བདག་གིས་བརྟག་པར་བྱའོ་སྙམ་དུ་སེམས་སོ།
en: Thereupon Śakra, mighty lord of the gods, had the following thought: ‘I should examine whether or not this bodhisattva great being Sadāprarudita will sacrifice his own body with genuine intent, out of desire for the Dharma.’

source: །དེ་ནས་བརྒྱ་བྱིན་ལྷའི་དབང་པོ་བྲམ་ཟེའི་ཁྱེའུ་ཞིག་ཏུ་མངོན་པར་སྤྲུལ་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་ལ་འདི་སྐད་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་ཅིའི་ཕྱིར་ཡིད་མི་དགའ་ཞིང་མྱ་ངན་བྱེད་ལ་ངུ་ཞིང་འདུག། རབ་ཏུ་ངུ་བས་བྲམ་ཟེའི་ཁྱེའུ་ལ་འདི་སྐད་སྨྲས་སོ།
en: Śakra, mighty lord of the gods, then emanated as a brahmin boy, approached the place where the bodhisattva great being Sadāprarudita was, and said to him, ‘Noble sir, why do you stand there depressed, sorrowful, and weeping?’

source: །བྲམ་ཟེའི་ཁྱེའུ་བདག་ནི་ཆོས་འདོད་པའི་ཕྱིར། བདག་གི་ལུས་བཙོངས་ཏེ་ཆོས་ལ་མཆོད་པར་འདོད་ན།
en: Sadāprarudita replied, ‘Brahmin boy, when I wanted to sell my body out of desire for the Dharma and to worship the Dharma, I could not find a buyer.

source: བདག་ཉོ་བ་མ་རྙེད་དེ་དེ་ལ་བདག་འདི་སྙམ་དུ་གང་བདག་གི་ལུས་བཙོངས་ནས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མཆོད་པ་བྱ་ཞིང་འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ལ་ཡང་། བཀུར་སྟིར་བྱ་བ་དེ་ལྟ་བུའི་ལུས་ཉོ་བ་ཡང་མ་རྙེད་པ་དེ།
en: I thought that after selling my body, I should worship the perfection of wisdom, and also venerate the sublime bodhisattva great being Dharmodgata, but I did not find anyone to buy a body such as this!

source: ཨེ་མའོ་བདག་བསོད་ནམས་རེ་ཆུང་སྙམ་དུ་སེམས་སོ།
en: Alas, how meager is my merit!’ “

source: །དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་དེས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་ལ་འདི་སྐད་སྨྲས་སོ། །རིགས་ཀྱི་བུ་བདག་ལ་མི་ནི་མི་དགོས་ཀྱི། བདག་མཆོད་སྦྱིན་ཞིག་བྱེད་པས།
en: Then that brahmin boy said to the bodhisattva great being Sadāprarudita, ‘Noble son, I myself do not need a man, but I am making a sacrificial offering.

source: དེར་མིའི་སྙིང་དང་། ཁྲག་དང་རུས་པ་དང་།
en: For that I need a human heart, blood, bones, and marrow.

source: རྐང་དགོས་ན་དེ་ཉོར་སྦྱིན་ནམ།
en: Will you give them if I pay for them?’ “

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་འདི་སྙམ་དུ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་མཁས་པར་བྱ་བའི་ཕྱིར། ཁྱེའུ་འདི་ལ་བདག་གི་ལུས་དང་། སྙིང་དང་ཁྲག་དང་། རུས་པ་དང་། རྐང་ཉོ་བ་རྙེད་པ་ནི།
en: Then the bodhisattva great being Sadāprarudita thought, ‘So that I might become skilled in the perfection of wisdom, I have in this boy found a buyer for my body, heart, blood, bones, and marrow.

source: བདག་གིས་རྙེད་པའི་མཆོག་རབ་ཏུ་རྙེད།
en: I have found the best of profits.

source: བདག་གིས་ལུས་ཀྱང་དོན་ཡོད་པར་གྱུར་ཏོ་སྙམ་དུ་སེམས་ཏེ།
en: My body is indeed useful!’

source: དེ་དགའ་མགུ་རབ་ཏུ་དགའ་བའི་སེམས་སུ་གྱུར་ནས། ཁྱེའུ་དེ་ལ་འདི་སྐད་སྨྲས་སོ། །ཁྱེའུ་ཁྱོད་ལུས་འདི་གང་གི་ཕྱིར་དགོས་པ་དེ་སྦྱིན་ནོ།
en: Elated and with joyful mind, he said to that boy, ‘Boy, I will give you this body, since you have need of it!’ “

source: །དེས་དེ་ལ་འདི་སྐད་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་ལ་རིན་ཅི་ཞིག་སྦྱིན།
en: The boy asked him, ‘Noble son, what price should I give you?’ “

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བས་ཁྱེའུ་དེ་ལ་འདི་སྐད་སྨྲས་སོ། །ཁྱེའུ་ཁྱོད་ཀྱིས་གང་ཡོངས་སུ་བཏང་བ་དེ་བྱིན་ཅིག །
en: The bodhisattva great being Sadāprarudita answered, ‘Boy, you may give me whatever you will!’

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བས་མཚོན་རྣོན་པོ་ཞིག་ཐོགས་ཏེ་དཔུང་པ་གཡས་པ་ཕུག་ནས་ཁྲག་ཕྱུང་ངོ་།
en: Then the bodhisattva great being Sadāprarudita, holding a sharp weapon, pierced his right shoulder, and made the blood flow.

source: །བརླ་གཡས་པ་ཡང་བཅད་ནས་ཤ་མེད་པར་བྱས་དེ། རྩིག་པ་ཞིག་གི་དྲུང་དུ་རུས་པ་གཅོག་ཏུ་སོང་ངོ་།
en: He cut his right thigh open, extracted the flesh, {Va.246} and went toward a wall in order to break the bones.

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་མོ་ཞིག་ཁང་ཐོག་ན་འདུག་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ། བརླའི་ཤ་མེད་པར་བྱས་ནས། རྩིག་པའི་དྲུང་དུ་རུས་པ་གཅོག་ཏུ་སོང་བ་མཐོང་བ་དང་། དེ་འདི་སྙམ་དུ་རིགས་ཀྱི་བུ་ཅིའི་ཕྱིར་བདག་གིས་བདག་ལ་གནོད་པར་བྱེད།
en: A merchant’s daughter who was sitting on the roof of her house then saw the bodhisattva great being Sadāprarudita going toward the wall in order to break his bones after having extracted the flesh from his thigh, and she thought, ‘Why is that noble son harming himself?

source: དེ་བདག་གིས་རིགས་ཀྱི་བུ་དེའི་དྲུང་དུ་སོང་སྟེ་དྲིའོ་སྙམ་དུ་སེམས་སོ།
en: I will approach that noble son and ask him.’

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་མོ་དེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་གང་ན་བ་དེར་སོང་སྟེ། དེར་ཕྱིན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་ལ་འདི་སྐད་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་ཅིའི་ཕྱིར་འདི་ལྟར་བདག་ལ་བདག་གནོད་པར་བྱེད།
en: The merchant’s daughter went to where the bodhisattva great being Sadāprarudita was, and asked him, ‘Noble sir, why are you injuring yourself in this way?

source: ཁྲག་དང་རུས་པ་དང་རྐང་དེ་དག་གིས་ཀྱང་ཅི་ཞིག་བྱ། རྟག་པར་རབ་ཏུ་ངུ་བས་བུ་མོ་དེ་ལ་འདི་སྐད་སྨྲས་སོ།
en: What will you do with this blood, bone, and marrow?’ “

source: །འདི་དག་ཁྱེའུ་དེ་ལ་བཙོངས་ནས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་མཆོད་ཅིང་། འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ལ་ཡང་རིམ་གྲོར་བྱའོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་ལ་ཚོངས་དཔོན་གྱི་བུ་མོ་དེས་འདི་སྐད་སྨྲས་སོ།
en: Sadāprarudita said to the girl, ‘When I have sold them to that boy, I will worship the perfection of wisdom, and serve the sublime bodhisattva great being Dharmodgata.’ “

source: །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱི་སྙིང་དང་། ཁྲག་དང་རུས་པ་དང་རྐང་བཙོངས་ཏེ། འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ལ་རིམ་གྲོར་བྱས་ན་ཡོན་ཏན་ཅི་ཞིག་ཡོད། དེས་བུ་མོ་དེ་ལ་འདི་སྐད་སྨྲས་སོ། །བུ་མོ་རིགས་ཀྱི་བུ་དེ་ནི་གང་ལ་ངེད་ཀྱིས་བསླབས་ན། སེམས་ཅན་ཐམས་ཅད་རྗེས་སུ་འབྲང་བར་འགྱུར་བ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་སངས་རྒྱས་ནས། ལུས་གསེར་གྱི་ཁ་དོག་ལྟ་བུར་འགྱུར་བ་དང་། སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་དང་། འོད་འདོམ་གང་བ་དང་། འོད་ཟེར་མཐའ་ཡས་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། དགའ་བ་ཆེན་པོ་དང་། བཏང་སྙོམས་ཆེན་པོ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་།
en: Thereupon, the merchant’s daughter said to the bodhisattva great being Sadāprarudita, ‘Noble sir, what are the enlightened attributes that you will have if you sell your heart, blood, bone, and marrow, and then serve the sublime bodhisattva great being Dharmodgata?’ “

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། ཉམས་པར་མི་འགྱུར་བའི་མངོན་པར་ཤེས་པ་ལྔ་དང་། ཚུལ་ཁྲིམས་རྣམ་པར་དག་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། ཏིང་ངེ་འཛིན་རྣམ་པར་དག་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་།
en: He replied to the girl, ‘Girl, he will teach me skill in means with regard to the perfection of wisdom and I will train in it, so that, once I have trained under that noble son, all beings will follow, and after I have attained manifest buddhahood in unsurpassed, complete enlightenment, my body will become golden in color, and I will acquire the thirty-two major marks of a great person, the eighty excellent minor marks, an aureole of light extending a full arm span, infinite light rays, great loving kindness, great compassion, great empathetic joy, great equanimity, the four fearlessnesses, the four kinds of exact knowledge, the ten powers of the tathāgatas, the eighteen distinct qualities of the buddhas, the five extrasensory powers without degeneration, inconceivable purity of ethical discipline, inconceivable purity of meditative stability, and inconceivable purity of wisdom.

source: ཤེས་རབ་རྣམ་པར་དག་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། གཞན་ཡང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་རྣམས་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱ་བ་དང་། གང་སེམས་ཅན་ཐམས་ཅད་ལ་བགོར་ཡོད་པ།
en: Moreover, I will share with all beings the inconceivable distinct qualities of the buddhas and the attainment of manifest buddhahood in unsurpassed, complete enlightenment!’ “

source: བླ་ན་མེད་པའི་ཆོས་རིན་པོ་ཆེ་རབ་ཏུ་ཐོབ་པར་འགྱུར་བ། དེ་ལྟ་བུའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཐབས་མཁས་པ། བདག་ལ་སྟོན་ཏེ་དེ་ལ་བདག་སློབ་བོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་ལ་ཚོང་དཔོན་གྱི་བུ་མོ་དེས་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཡོངས་སུ་བསྒྲགས་པའི་ཆོས་རྒྱ་ཆེན་པོ་དེ་དག་ནི་ངོ་མཚར་ཆེ་སྟེ།
en: Then the merchant’s daughter said to the bodhisattva great being Sadāprarudita, ‘How wonderful, noble sir, are these extensive attributes that you have proclaimed!

source: རིགས་ཀྱི་བུ་ཆོས་དེ་ལྟ་བུ་རེ་རེའི་ཕྱིར་ཡང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་ལུས་ཀྱང་ཡོངས་སུ་བཏང་བར་འོས་ན། གཅིག་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: Noble sir, even for a single one of those attributes it would be worthwhile sacrificing all one’s bodies, numerous as the grains of sand of the river Gaṅgā, let alone one of them!

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་སངས་རྒྱས་ཀྱིས་ཆོས་རྒྱ་ཆེན་པོ་བསམ་གྱིས་མི་ཁྱབ་པ། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་། བདེ་བར་འགྱུར་བ་འདི་དག་ཡོངས་སུ་བསྒྲགས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་ཅི་དགོས་པ་གསེར་རམ། དངུལ་ལམ། བཻ་ཌཱུརྱ་འམ། ནོར་བུ་རིན་པོ་ཆེ་འམ། མུ་ཏིག་གམ། མེ་ཏོག་གམ། བདུག་པ་འམ། སྤོས་སམ། ཕྲེང་བ་འམ། བྱུག་པ་འམ།
en: Noble sir, you have proclaimed these inconceivable and extensive attributes of the buddhas, which bring benefit and happiness to all beings.

source: ཕྱེ་མ་འམ། གོས་སམ། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་གང་གིས་འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་དེ་ལ་རིམ་གྲོར་བྱ་བར་འགྱུར་བ་དེ་དག་བདག་གིས་ཕ་མ་ལས་བསླངས་ཏེ་སྦྱིན་གྱིས།
en: Noble sir, I will request from my parents and give you whatever you need—be it gold, silver, beryl, precious gems, pearls, flowers, incense, perfume, garlands, unguents, powders, clothing, parasols, victory banners, or ribbons—with which to serve that sublime bodhisattva great being Dharmodgata.

source: བདག་ལ་བདག་འདི་ལྟ་བུའི་གནོད་པ་མ་བྱེད་ཅིག །
en: Do not inflict such injuries on yourself!

source: བདག་ཀྱང་ཆོས་དེ་རྣམས་འདོད་དེ། བདག་ཀྱང་འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་གང་ན་བ་དེར་ཁྱོད་དང་ལྷན་ཅིག་ཏུ་འགྲོའོ།
en: I also will go with you that place where the sublime, bodhisattva great being Dharmodgata is.

source: །བདག་ཀྱང་འདི་ལྟར་ཆོས་དེ་ལྟ་བུ་དེ་དག་ཐོབ་པར་བྱ་བའི་ཕྱིར་ཁྱོད་དང་ལྷན་ཅིག་ཏུ་དགེ་བའི་རྩ་བ་བསྐྱེད་དོ།
en: Together with you, I also will cultivate the roots of virtuous action in order to attain such attributes!’ {

source: །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་བྲམ་ཟེའི་ཁྱེའུ་ཡི་ལུས་མི་སྣང་བར་བྱས་ནས། བདག་ཉིད་ཀྱི་ལུས་སུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བའི་མདུན་དུ་འདུག་ནས་འདི་སྐད་སྨྲས་སོ། །རིགས་ཀྱི་བུ་འདི་ལྟ་བུར་ཡི་དམ་ལ་བརྟན་པ་ལེགས་སོ།
en: Va.247} “Thereupon Śakra, mighty lord of the gods, caused the body of the brahmin boy to disappear, and manifested in his own body before the bodhisattva great being Sadāprarudita, saying, ‘Noble son, your commitment is steadfast.

source: །རིགས་ཀྱི་བུ་སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་ཀྱང་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ། ཆོས་དོན་དུ་གཉེར་བའི་ཚུལ་འདི་ལྟ་བུས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཐབས་མཁས་པས་བཙལ་ཅིང་དགེ་བའི་བཤེས་གཉེན་ལ་ཡོངས་སུ་དྲིས་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: Noble son, formerly too, when the tathāgatas, arhats, completely awakened buddhas of the past practiced the conduct of the bodhisattvas, they searched skillfully for the sake of the perfection of wisdom with such earnestness for the Dharma, and after questioning spiritual mentors, they attained consummate buddhahood in unsurpassed, complete enlightenment.

source: །རིགས་ཀྱི་བུ་བདག་ལ་ནི་སྙིང་དང་། ཁྲག་དང་རུས་པ་དང་རྐང་མི་དགོས་ཀྱི།
en: Noble son, I have no need for your heart, blood, bones, or marrow.

source: ཁྱོད་ལ་ཉམས་སད་པའི་ཕྱིར་འདིར་འོངས་ཀྱིས།
en: I came here to test you.

source: རིགས་ཀྱི་བུ་ཁྱོད་ལ་མཆོག་ཇི་ཙམ་ཞིག་སྦྱིན་པར་བྱ་བའི་མཆོག་སློངས་ཤིག །
en: Noble son, you may ask for whatever boon I can give!’ “

source: རྟག་པར་རབ་ཏུ་ངུ་བས་བརྒྱ་བྱིན་ལ་སྨྲས་པ། བརྒྱ་བྱིན་བདག་ལ་བླ་ན་མེད་པའི་སངས་རྒྱས་ཀྱི་ཆོས་བྱིན་ཅིག།
en: Sadāprarudita answered Śakra, ‘Śakra, give me the unsurpassed attributes of the buddhas!’ “

source: བརྒྱ་བྱིན་གྱིས་སྨྲས་པ། རིགས་ཀྱི་བུ་ཡུལ་འདི་ནི་བདག་གི་སྤྱོད་ཡུལ་མ་ཡིན་གྱི། ཡུལ་འདི་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་སྤྱོད་ཡུལ་ལོ།
en: Śakra replied, ‘Noble son, that is not something within my own domain—it is only within the domain of the lord buddhas.

source: །དེ་བས་ན་མཆོག་གཞན་ཞིག་སློངས་ཤིག །
en: So you should ask for another boon. Choose another boon!’ “

source: བྱང་ཆུབ་སེམས་དཔའ་རྟག་པར་རབ་ཏུ་ངུ་བས་སྨྲས་པ། ལྷའི་དབང་པོ་འོ་ན་ཁྱོད་ཐུགས་ཁྲལ་ཆུང་ངུ་གྱིས་ལ་བཞུགས་ཤིག།
en: The bodhisattva Sadāprarudita said, ‘Lord of the gods, you should not worry!

source: བདག་གིས་ལུས་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར། བདག་རང་བདེན་པ་གང་གིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཅིང་། བདག་ལ་སྒྱུ་མེད་པ་དང་ལྷག་པའི་བསམ་པ་ཡོད་པར་བདེན་པའི་བྱིན་གྱིས་བརླབས་བྱའོ།
en: In order to make my own body whole again, the tathāgatas, arhats, completely awakened buddhas will consecrate my own declaration of truth, uttered without deceit and with higher aspiration, through which they will prophesy my attaining of unsurpassed, complete enlightenment.

source: །ལྷའི་དབང་པོ་བདེན་པ་དེ་དང་བདེན་པའི་ཚིག་དེས་བདག་གི་ལུས་སྔ་མ་བཞིན་དུ་གྱུར་ཅིག །དེ་ནས་སྐད་ཅིག་དེ་དང་།
en: Lord of the gods, through that truth and these words of truth may my body become as it was before!’

source: ཐང་ཅིག་དེ་དང་། ཡུད་ཙམ་དེ་ཉིད་ལ་སངས་རྒྱས་ཀྱི་མཐུ་དང་། ལྷག་པའི་བསམ་པ་ཡོངས་སུ་དག་པས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བའི་ལུས་སྔ་མ་བཞིན་དུ་གནས་པར་གྱུར་ཏོ།
en: Then, in an instant, in a moment, in a second, through the power of the buddhas and the purity of this higher aspiration, the body of the bodhisattva great being Sadāprarudita became as it had been before.

source: །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་སྤོབས་པ་མེད་པར་གྱུར་ཏེ།
en: Then Śakra, mighty lord of the gods, was deflated.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་ལ་དེ་ལས་གཞན་ལན་འདེབས་མ་ནུས་ནས། གནས་དེ་ཉིད་དུ་མི་སྣང་བར་གྱུར་ཏོ།
en: Unable to offer the bodhisattva great being Sadāprarudita any response apart from that, he disappeared from that very place. “

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་མོ་དེས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་ལ་འདི་སྐད་སྨྲས་སོ།
en: Then the merchant’s daughter said to the bodhisattva great being Sadāprarudita, ‘Come here, noble sir.

source: །རིགས་ཀྱི་བུ་བདག་གི་ཁྱིམ་གང་ན་བ་དེར་བཞུད་ཀྱིས་ཚུར་སྤྱོན།
en: Let us go into my house.

source: བདག་གི་ཕ་མ་ལས་ནོར་བསླངས་ཏེ། ཁྱོད་ཆོས་འདོད་པའི་ཕྱིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མཆོད་པ་དང་། འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་དེ་ལ་རིམ་གྲོར་བྱ་བའི་ནོར་དེ་ཁྱོད་ལ་སྦྱིན་ནོ།
en: I shall ask my parents for our riches and give them to you, so that you may, out of desire for the Dharma, worship the perfection of wisdom, and serve the sublime bodhisattva great being Dharmodgata.’

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་ཚོང་དཔོན་གྱི་བུ་མོ་དེ་དང་ལྷན་ཅིག་ཏུ་དེའི་ཁྱིམ་གང་ན་བ་དེར་དོང་ངོ་།
en: The bodhisattva great being Sadāprarudita and the merchant’s daughter then went together to her house.

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་མོ་དེ་བདག་གི་ཁྱིམ་དུ་སོང་ནས། ཕ་མ་ལ་འདི་སྐད་སྨྲས་སོ། །ཡབ་ཡུམ་བདག་ལ་ནོར་མང་པོ་སྩལ་དུ་གསོལ། །གསེར་དང་། དངུལ་དང་། རིན་པོ་ཆེ་དང་། ནོར་བུ་དང་། གོས་དང་། མེ་ཏོག་དང་། བདུག་པ་དང་།
en: The merchant’s daughter went inside and said to her parents, ‘Mother and father, please give me bountiful riches.

source: སྤོས་དང་། ཕྲེང་བ་དང་བྱུག་པ་དང་ཕྱེ་མ་དང་། ཆོས་གོས་དང་། གདུགས་དང་རྒྱལ་མཚན་དང་། བ་དན་རྣམས་དང་སིལ་སྙན་གྱི་བྱེ་བྲག་རྣམ་པ་མང་པོ་རྣམས་བདག་ལ་སྩལ་དུ་གསོལ།
en: Please give me much gold, silver, jewels, gems, clothing, flowers, incense, perfume, garlands, unguents, powders, religious robes, parasols, victory banners, ribbons, and particular sorts of cymbals.

source: ཁྱེད་ཀྱིས་བདག་ལ་འཁོར་དུ་སྩལ་པའི་བུ་མོ་ལྔ་བརྒྱ་པོ་འདི་རྣམས་དང་། ལྷན་ཅིག་ཏུ་བདག་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མཆོད་ཅིང་། འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ལ་རིམ་གྲོ་བགྱིད་དུ་མཆི་བར་ཅི་གནང་།
en: Together with these five hundred maidens you gave me as servants, will you permit me to go with the bodhisattva great being Sadāprarudita to worship the perfection of wisdom and to serve the sublime bodhisattva great being Dharmodgata?

source: དེས་བདག་ཅག་ལ་ཆོས་བཤད་ན། སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་ཐོབ་པར་འགྱུར་རོ།
en: When he has explained the Dharma to us, we will attain the inconceivable attributes of the buddhas.’ “

source: །དེ་ནས་བུ་མོ་དེའི་ཕ་མ་གཉིས་ཀྱིས་བུ་མོ་དེ་ལ་འདི་སྐད་སྨྲས་སོ། །བུ་མོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་ཞེས་བྱ་བ་དེ་སུ་ཞིག །
en: The girl’s parents then asked her, ‘Who is this bodhisattva great being Sadāprarudita?

source: ད་ལྟ་ག་ལ་འདུག །
en: Where is he right now?’ “

source: བུ་མོས་སྨྲས་པ། རིགས་ཀྱི་བུ་དེ་འོ་སྐོལ་གྱི་ཆབ་སྒོའི་དྲུང་ན་མཆིས་ཏེ།
en: The girl replied, ‘This noble son is standing at the door of our house.

source: རིགས་ཀྱི་བུ་དེ་ཡང་ལྷག་པའི་བསམ་པས། བླ་ན་མ་མཆིས་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་རབ་ཏུ་ཞུགས་པ་ནི་འདི་ལྟ་སྟེ།
en: Through his higher aspiration, this noble son has set out for unsurpassed, complete enlightenment.

source: སེམས་ཅན་ཐམས་ཅད་དཔག་ཏུ་མ་མཆིས་པའི་འཁོར་བའི་སྡུག་བསྔལ་གྱི་ཚོགས་ལས་ཐར་བར་འཚལ་བའི་སླད་དུ་དམ་པའི་ཆོས་འཚལ་བས།
en: That is to say, he is seeking the Dharma in order to liberate all beings from the inestimable sufferings of cyclic existence. {

source: བདག་གི་ལུས་བཙོངས་ཏེ་དམ་པའི་ཆོས་ཀྱི་ཚུལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ལ་རིམ་གྲོ་བགྱི་བར་འཚལ་ན། དེའི་ལུས་ཉོ་བ་ཡང་མ་རྙེད་ནས།
en: Va.248} So he sought to sell his own body in order to serve the perfection of wisdom and the sublime bodhisattva great being Dharmodgata, but could not find a buyer for his body.

source: དེ་སྡུག་བསྔལ་བར་གྱུར་ཡིད་མི་དགའ་སེམས་ཁོངས་སུ་ཆུད། ཡི་ཆད་ནས་ངུ་ཞིང་འདུག་པ་དང་།
en: He then became sorrowful, distressed, introspective, and dejected and stood there weeping.

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་བྲམ་ཟེའི་ཁྱེའུ་ཞིག་གི་ལུས་སུ་སྤྲུལ་ནས། དེ་ལ་ཉམས་སད་པའི་ཕྱིར་རིགས་ཀྱི་བུ་ཁྱོད་སྡུག་བསྔལ་ཞིང་ཡིད་མི་དགའ་བ་དང་། སེམས་ཁོངས་སུ་ཆུད་དེ་ཡི་ཆད་ནས། ཅིའི་ཕྱིར་ངུ་ཞིང་འདུག་ཅེས་སྨྲས་པ་དང་།
en: Śakra, mighty lord of the gods, then emanated as a brahmin boy and in order to test him, said, “Noble son, why do you stand here weeping, sorrowful, distressed, introspective, and dejected?”

source: དེས་དེ་ལ་བདག་ནི་བདག་གི་ལུས་འཚོང་ན། དེ་ཉོ་བ་ཡང་མེད་དོ་ཞེས་སྨྲས་སོ།
en: and he replied, “I want to sell my own body but there is no one to buy it.”

source: །བརྒྱ་བྱིན་ཁྱེའུའི་ལུས་སུ་བསྒྱུར་བས་སྨྲས་པ་རིགས་ཀྱི་བུ་ཁྱོད་ཅིའི་ཕྱིར་བདག་གི་ལུས་འཚོང་། རྟག་པར་རབ་ཏུ་ངུ་བས་སྨྲས་པ།
en: Śakra, transformed into the body of that boy, then said, “Noble son, why do you want to sell your body?”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མཆོད་པ་དང་། འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ལ་རིམ་གྲོར་བྱ་བའི་ཕྱིར་རོ།
en: and Sadāprarudita replied, “So as to worship the perfection of wisdom and serve the sublime bodhisattva great being Dharmodgata.

source: །དེ་ཡང་འདི་ལྟར་ཆོས་འདོད་པའི་ཕྱིར་ཏེ། དེ་ལ་བདག་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་རག་ལུས་སོ།
en: I am depending on the attributes of the buddhas.”

source: །ཁྱེའུའི་གཟུགས་སུ་བསྒྱུར་བའི་བརྒྱ་བྱིན་གྱིས་སྨྲས་པ། རིགས་ཀྱི་བུ་བདག་ལ་མི་ནི་མི་དགོས་ཀྱི། བདག་མཆོད་སྦྱིན་ཞིག་བྱེད་པས། དེར་བདག་ལ་མིའི་སྙིང་དང་། ཁྲག་དང་རུས་པ་དང་རྐང་དག་དགོས་སོ།
en: Śakra, transformed into the form of that boy, then said, “Noble son, I do not need a man, but I am making a sacrifice, so for that I need a human heart, blood, bones, and marrow.”

source: །དེ་ནས་རིགས་ཀྱི་བུ་དེ་སེམས་མ་ཞུམ་པར་གྱུར་ནས། དེ་ཡང་སྦྱིན་ནོ་ཞེས་སྨྲས་ཏེ།
en: Then that noble son, without discouragement, said, “I will donate them!”

source: དེ་མཚོན་རྣོན་པོ་ཞིག་ཐོགས་ཏེ། བདག་གི་དཔུང་པ་ཕུག་སྟེ་ཁྲག་ཕྱུང་བརླ་ཡང་ཤ་མེད་པར་བྱས་ནས།
en: Holding a sharp weapon, he pierced his own shoulder and made the blood flow.

source: རྩིག་པ་ཞིག་གི་དྲུང་དུ་རུས་པ་གཅོག་ཏུ་སོང་སྟེ། རུས་པ་དང་རྐང་སྦྱིན་ནོ་སྙམ་པ་ལས།
en: He cut his thigh open, extracted the flesh, and then went toward a wall in order to break his bones, thinking to donate his bones and marrow.

source: དེ་ཁྲག་ཟག་ཅིང་འདུག་པ་བདག་གིས་ཁང་ཐོག་ནས་མཐོང་བ་དང་། དེ་ལ་བདག་འདི་སྙམ་དུ་མི་འདི་ཅི་བྱེད་པ་ཞིག། འདི་ལྟར་བདག་ལ་བདག་གནོད་པར་བྱེད་སྙམ་ནས།
en: But from the roof of the house I saw him bleeding and thought, “What is that man doing, harming himself in this way?”

source: དེའི་དྲུང་དུ་བདག་མཆིས་ཏེ་འདི་སྐད་སྨྲས་སོ། རིགས་ཀྱི་བུ་ཁྱོད་ཅིའི་ཕྱིར་བདག་ལ་བདག་ཁྲག་འབྱིན།
en: I approached and asked him, “Noble sir, why are you drawing your own blood?”

source: དེ་ནས་རིགས་ཀྱི་བུ་དེས་བདག་ལ་འདི་སྐད་སྨྲས་སོ། །བྲམ་ཟེའི་ཁྱེའུ་འདི་ལ་ཁྲག་དང་སྙིང་དང་རུས་པ་དང་རྐང་སྦྱིན་ནོ།
en: Then that noble son replied to me, “I am donating my blood, heart, bones, and marrow to this brahmin boy.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། བདག་ནི་དབུལ་བས་ནོར་གཞན་ཅུང་ཟད་ཀྱང་མེད་དོ།
en: If you ask why, I am poor and have no other wealth at all.”

source: །དེ་ལ་བདག་གིས་འདི་སྐད་སྨྲས་སོ། །ནོར་དེས་ཁྱོད་ལ་ཅི་ཞིག་བྱ།
en: I then asked him, “What would you do with that wealth?”

source: དེས་བདག་ལ་འདི་སྐད་སྨྲས་སོ། །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མཆོད་ཅིང་ཆོས་འདོད་པའི་ཕྱིར། འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ལ་རིམ་གྲོར་བྱའོ། །དེ་ལ་བདག་གིས་འདི་སྐད་སྨྲས་སོ།
en: and he replied, “I must worship the perfection of wisdom, and out of desire for the Dharma, I must serve the sublime bodhisattva great being Dharmodgata.”

source: །རིགས་ཀྱི་བུ་ཁྱོད་དེ་ལས་ཡོན་ཏན་གྱི་རིགས་དང་།
en: So I asked him, “What sort of enlightened attributes would you seek as a result of this?

source: ཡོན་ཏན་གྱི་བྱེ་བྲག་ཅི་ཞིག་འབྱུང་།
en: What are the details of those enlightened attributes?”

source: དེས་བདག་ལ་འདི་སྐད་སྨྲས་སོ། །དེ་ནི་བདག་ལ་སངས་རྒྱས་ཀྱི་ཆོས་དང་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་བསམ་གྱིས་མི་ཁྱབ་པ་རབ་ཏུ་སྟོན་པར་འགྱུར་ཞིང་།
en: And he replied, “He will reveal to me the qualities of the buddhas and the inconceivable enlightened attributes of the buddhas.

source: དེ་བཞིན་གཤེགས་པའི་ཆོས་དཔག་ཏུ་མེད་པ་མི་འཕྲོགས་པ་དེ་ལྟ་བུའི་ཆོས་རྣམས་དེ་ལས་ཐོབ་པར་འགྱུར་རོ།
en: From him I will obtain such unassailable and inestimable attributes of the tathāgatas.

source: །དེ་བདག་གིས་ཐོབ་པ་དང་།
en: I will attain them.”

source: དགའ་ཞིང་མགུ་བ་ཆེན་པོ་སྐྱེས་ཤིང་། སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་དེ་དག་ཐོས་པ་དང་བདག་འདི་སྙམ་དུ་གྱུར་ཏོ། །གང་འདི་ལྟ་བུ་དག་བྱེད་ནུས་པ་ནི། རིགས་ཀྱི་བུ་འདི་དཀའ་བ་སྤྱོད་པ་སྟེ་ངོ་མཚར་ཆེའོ།
en: With elation and great joy I heard about those inconceivable attributes of the buddhas, and thought to myself, “It is wonderful that this noble son can undertake such austerities.

source: །རིགས་ཀྱི་བུ་འདི་ནི་ཆོས་འདོད་པའི་ཕྱིར་བདག་གིས་ལུས་ཡོངས་སུ་གཏོང་ན། བདག་ཅག་གིས་ཅིའི་ཕྱིར་ཆོས་འདི་མཆོད་པར་མི་བྱ་འདི་ལྟ་བུ་དག་གི་གནས་སུ་ཅིའི་ཕྱིར་སྨོན་ལམ་མི་གདབ།
en: If this noble son would sacrifice his own body out of desire for the Dharma, why should we not worship this Dharma? Why should we not make aspiration prayers to reach such states?

source: བདག་ཅག་ལ་ལོངས་སྤྱོད་རྒྱ་ཆེན་པོ་རབ་ཏུ་མང་དུ་ཡོད་དོ་སྙམ་ནས།
en: We have an abundance of resources.”

source: བདག་གིས་རིགས་ཀྱི་བུ་འདི་ལ་འདི་སྐད་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་བདག་ལ་གནོད་པ་འདི་ལྟ་བུ་མ་བྱེད་ཅིག།
en: Then I said to this noble son, “Noble sir, do not inflict such injury on yourself!

source: བདག་གིས་ནོར་མང་པོ་ཕ་མ་ལས་བསླངས་ཏེ་སྦྱིན་ནོ།
en: I shall ask my parents for much wealth and give it to you.

source: །དེས་ཁྱོད་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ལ་རིམ་གྲོ་བྱོས་ཤིག།
en: With that you should serve the perfection of wisdom and the sublime bodhisattva great being Dharmodgata.

source: བདག་ཀྱང་ཁྱོད་དང་ལྷན་ཅིག་ཏུ། འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་གང་ན་བ་དེར་སོང་སྟེ།
en: I too shall go together with you to the place where the sublime bodhisattva great being Dharmodgata resides.
